{"job":[{"id":"o1fjVfwe","title":"Director, Talent Acquisition","requisitionId":{},"category":"Finance, HR, Operations, Recruiting and IT","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/19/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o1fjVfwe","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o1fjVfwe","description":"<strong>Job Description:</strong><br /> &nbsp;<br /> You will lead the talent acquisition team and build the talent/employer brand, as well as the strategies needed for us to find the incredible people that meet our high expectations.&nbsp; We are growing like crazy, so when you succeed you will have impacted our company in a way that will be truly transformative, and you will be directly responsible for helping us drive exponential energy savings.&nbsp; No one is saying it&rsquo;s going to be easy, but it just might be the most rewarding thing you&rsquo;ll ever do.<br /> &nbsp;<br /> So if you&rsquo;re fantastic at what you do, we want to talk to you. If you constantly seek creative ways to become even more nimble and effective, you&rsquo;re our type of person. You prize teamwork? We shop at the same store. If you love to laugh, you&rsquo;ll fit right in.<br /><br /> <strong>About the job</strong><br /> <ul> <li>Recruiting world class talent</li> <li>Developing OPOWER's Talent/Employer Brand</li> <li>Creating and implementing an outstanding &ldquo;new employee&rdquo; experience for OPOWER hires</li> <li>Lead a team of talent acquisition specialists to find and hire the best talent in the world</li> <li>Sourcing and recruiting for roles at all levels in the organization</li> <li>Develop a pipeline of exceptionally qualified candidates and maintain their level of interest</li> <li>Manage external resources including, among others, recruiting firms</li> <li>Drive Workforce planning regularly throughout the organization</li> <li>Launch new recruiting / career web site</li> <li>Develop and continually refine SEO/CSO strategies</li> <li>Build world-class social recruiting effort</li> <li>Improve the effectiveness of OPOWER's internal referral program</li> </ul> <strong>About You</strong><br /> <ul> <li>Minimum of 10 years of experience with a degree from an accredited university/college in Business, Human Resources or Organizational Development<br /></li> <li>Proven experience in the following areas:<br />- Building and leading superior world-class talent acquisition teams<br />- Proven experience building talent/employer brands<br />- Leading workforce planning processes<br />- A preference for, and ability to thrive in dynamic and fast paced, high growth environments<br />-Ability to map and develop high performance, low maintenance processes <br />-Proven ability to build and implement successful fresh, creative approaches to talent acquisition</li> </ul> <strong>About the Company</strong><br /> <br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oHekVfwU","title":"Executive Assistant to the VP of Product & VP of Engineering","requisitionId":{},"category":"Finance, HR, Operations, Recruiting and IT","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"6/8/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oHekVfwU","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oHekVfwU","description":"<br /> Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br /> <br /> <strong>Responsibilities</strong><br /> <ul> <li> Consistently keep things running smoothly for the VP Product and VP Engineering</li> <li> Own all calendaring, schedule meetings, handle frequent last-minute changes</li> <li> Execute on a time management strategy for the VP Product and VP Engineering, ensure that time is being managed according to guidance</li> <li> Book all travel arrangements, ensure fluid logistics, provide itineraries as needed, handle unforeseen travel issues quickly and efficiently</li> <li> Engage directly with outside parties (primarily by phone and email), leave a strong first impression, represent the company</li> <li> Handle occasional requests from the larger Product Management and Engineering teams, which may require special arrangements</li> <li> Provide a weekly summary of activities and review the upcoming week activities with the VP Product and VP Engineering</li> </ul> &nbsp;<br /> &nbsp;<br /> <strong>About You</strong><br /> <ul> <li> Minimum experience: Associates degree required, Bachelors degree strongly preferred</li> <li>Minimum work experience: 2+ years in a professional office environment</li> <li> Must be able to thrive and be excited about working in a fast-paced start-up environment</li> <li> Must be proficient with Windows or Mac (or both), Excel, Word, and email/calendaring software such as Google or Outlook</li> <li> Have a strong work ethic, be willing to do what it takes to get the job done</li> <li> Have excellent time management and organizational skills, demonstrate the ability to plan ahead, foresee issues before they arise, handle frequent changes gracefully</li> <li> Be an excellent high-bandwidth communicator, summarize information, get to the point, etc.</li> <li> Exhibit good judgment, demonstrate intuition about when it&rsquo;s appropriate to interrupt for urgent issues and when it is not</li> <li> Maintain a consistently positive attitude, express a genuine interest in the product development&nbsp; process, be excited about OPOWER&rsquo;s mission</li> </ul> &nbsp;<br /> <strong>About the Company</strong><br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"oSzmVfws","title":"Office/Facilities Coordinator","requisitionId":{},"category":"Finance, HR, Operations, Recruiting and IT","jobtype":{},"location":"Arlington, VA, United States","date":"8/10/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oSzmVfws","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oSzmVfws","description":"<strong>Job Description:</strong><br /> &nbsp;<br /> You will be responsible for organizing and coordinating office operations and procedures in order to ensure&nbsp;organizational effectiveness and efficiency. You will report to the Manager of Operations and are responsible for&nbsp;providing office services to all employees. This includes maintaining office services and maintaining office records.<br /> &nbsp;<br /> <strong>About the job:</strong><br /> &nbsp;<br /> &bull;Organize office operations: ordering office and kitchen supplies and maintaining office equipment<br /> &nbsp;<br /> &bull;Liaise with property manager to ensure proper maintenance of facility<br /> &nbsp;<br /> &bull;Maintain office areas, keeping them clean and free from clutter<br /> &nbsp;<br /> &bull;Manage the conference room setups<br /> &nbsp;<br /> &bull;Serve as primary contact for most vendor relationships and shipping/delivery needs<br /> &nbsp;<br /> &bull;Manage pre-event logistics and event follow-up for various departments<br /> &nbsp;<br /> &bull;Serve as a back-up for reception coverage as necessary<br /> &nbsp;<br /> &bull;Assist with office moves as directed by Manager of Operations<br /> &nbsp;<br /> &bull;Update office floor plan as necessary, maintain and update office furniture inventory<br /> &nbsp;<br /> &bull;Assist with new employee office/workstation setups, manage seating for staff coming from other offices<br /> &nbsp;<br /> &bull;Manage office files and vendor files<br /> &nbsp;<br /> &bull;Other duties as assigned<br /> &nbsp;<br /> <strong>About You:</strong><br /> &nbsp;<br /> &bull;Minimum of 2 years of experience in an office environment<br /> &nbsp;<br /> &bull;Strong MS Office skills required (Word, Excel and PowerPoint)<br /> &nbsp;<br /> &bull;Strong written and oral communication skills required<br /> &nbsp;<br /> &bull;Ability to work with minimum supervision and complete tasks in a timely manner with excellent attention to&nbsp;detail and ability to follow-through<br /> &nbsp;<br /> &bull;Highly organized with ability to multi-task, while maintaining accuracy<br /> &nbsp;<br /> &bull;Comfortable and confident in a supportive role while also taking initiative and demonstrating responsibility to&nbsp;ensure the office environment is the best it can be.<br /> &nbsp;<br /> &bull;Possess excellent people and customer service skills<br /> &nbsp;<br /> &bull;Be flexible with duties and able to prioritize tasks<br /> &nbsp;<br /> &bull;Ability to lift up to 50lbs<br /> &nbsp;<br /> <strong>About the Company:</strong><br /> &nbsp;<br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by&nbsp;empowering residential consumers to make better decisions on their energy usage. Through a platform which&nbsp;delivers home energy reports, robust online tools, insights based on data analytics, and customer service tools,&nbsp;OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across&nbsp;hundreds of thousands of households. The company is well funded and making big headlines as they stay on&nbsp;track to reach two million households by the end of 2010 and save enough energy to power a city of 150,000&nbsp;residents!<br /> &nbsp;<br /> NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO<br /> &nbsp;<br /> THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS<br /> &nbsp;<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oirlVfwJ","title":"Consumer Research Manager","requisitionId":{},"category":"Consumer Marketing & Analysis","jobtype":{},"location":"Arlington, VA, United States","date":"8/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oirlVfwJ","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oirlVfwJ","description":"<br /> <strong>About the Role:</strong><br /> OPOWER is looking for a strategic, energetic, and highly intelligent Consumer Research Manager to develop new consumer insights that are the key to our growing success at driving large-scale energy savings.&nbsp;&nbsp; OPOWER is the market leader in applied behavioral science in the energy efficiency space, engaging millions of consumers to reduce their energy usage with targeted, multi-channel marketing campaigns.&nbsp; A patent-pending, customer-engagement approach that leverages cutting-edge behavioral science, customer data analytics and the latest software has made OPOWER one of the hottest startups in the country.<br /> &nbsp;<br /> This is an exciting opportunity to be a core part of the Consumer Marketing &amp; Analysis team that creates and manages these marketing strategies, and is constantly testing and researching new ideas to drive ever-improving results.&nbsp;In this role you will lead quantitative and qualitative research to assess the effectiveness of OPOWER's programs and products. You will work with the marketing analysts, the direct and interactive marketing teams, and the user experience team to develop and pursue a research agenda that will help us understand the performance of our existing strategies and inform the development of new strategies.&nbsp; You will also work with the OPOWER client relationship managers and utility stakeholders as needed to pursue research efforts that involve our clients&rsquo; customers.<br /> &nbsp;<br /> One of the key initial projects will be to set up a longitudinal customer engagement assessment tool that can be used across our utility programs.&nbsp; In addition, you will be responsible for identifying, prioritizing, and executing research projects aimed at developing specific new consumer insights.&nbsp; For each research initiative, you will distill the findings into actionable insights and communicate key learnings and recommendations to colleagues at OPOWER and our utility partners.&nbsp;&nbsp; You will also be responsible for selecting and managing any vendors that support our research efforts.<br /> &nbsp;<br /> This position reports to the Director, Marketing Analytics.<br /> <strong>&nbsp;<br /> <br /> </strong><br /> <strong>About You:</strong><br /> * BS or BA from top school.<br /> * 5-7+ years of progressive experience in primary consumer research; experience assessing ongoing consumer relationships and engagement is a big plus.<br /> * 3+ years managing vendors to execute consumer research cost-effectively.<br /> * 3+ years developing integrated research plans &ndash; i.e., identifying, prioritizing, planning research initiatives.<br /> * Experience developing research panels and/or market research online communities a plus.<br /> * Ability and passion to operate at both strategic and tactical level &ndash; we need someone who can help set and guide our research priorities, as well as get hands dirty to execute specific projects.<br /> * You love digging into quantitative data and are self-sufficient to create and leverage pivot tables and cross-tabs to find the hidden insights.<br /> * Proven ability to synthesize the sometimes conflicting data available from varied sources into actionable insights: integrating quantitative and qualitative research; integrating primary and secondary research.<br /> * Ability to draft, review and finalize the creation of surveys, moderator guides, and other research instruments to produce unbiased results that uncover the key underlying insights.&nbsp; Ability to moderate focus groups is a plus.<br /> * Top-notch collaboration skills &ndash; you enjoy working with people in a variety of roles to develop the research plans and to turn findings into action.<br /> * You're a driven self-starter with positive outlook, flexible nature, and tenacious work style that will fit well within OPOWER's hyper-growth environment.<br /> <br /> &nbsp;<br /> &nbsp;<br /> <strong>About the Company</strong><br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oMymVfwl","title":"Interactive Marketing Manager","requisitionId":{},"category":"Consumer Marketing & Analysis","jobtype":{},"location":"Arlington, VA, United States","date":"8/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oMymVfwl","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oMymVfwl","description":"<br /><strong>About the Role:</strong><br />OPOWER is looking for a strategic, energetic, multi-skilled and highly intelligent<br />interactive marketer to develop, execute and analyze new strategies to amplify our<br />already large-scale energy savings. This is an exciting opportunity to be a core part of<br />our growing Interactive Marketing team. Our team is small and nimble and we&rsquo;re looking<br />for creative types who are bursting with new ideas, have the technical skills to bring<br />those ideas from conception to implementation and the analytic capacity to assess their<br />efficacy.<br />&nbsp;<br />At OPOWER we are passionate about energy efficiency and we are committed to<br />continually testing new engagement strategies and tactics. From personalized emails to<br />SMS alerts, targeted online advertising, social media and more, we know that we can<br />motivate customers to reduce their energy usage even further; we just need your help<br />figuring out how.<br />&nbsp;<br />In this role, you will work with the OPOWER client relationship managers, the marketing<br />analytics team, the direct marketing team, and the user experience team to bring<br />ideas from conception to execution. You must be ready to act fast to take advantage<br />of emerging opportunities, able to juggle multiple projects at the same time, draft<br />messages for multiple communication channels, able to write HTML and CSS and be<br />willing to test anything and trust the data.<br />This position reports to the Director, Interactive Marketing.<br />&nbsp;<br /><strong>About You:</strong><br />* BS or BA from top school.<br />* 3-5+ years of experience with online interactive marketing.<br />* As comfortable writing and editing HTML and CSS as you are at drafting and<br />modifying strategy memos and direct utility customer communications.<br />* A fearless data analyst, no matter how big or dirty the dataset.<br />* Have developed, run and analyzed marketing experiments with at least one<br />of the following (more than one is a major plus): online advertising, mass email<br />communications, SMS or IVR.<br />* Experience managing technology and design vendors for interactive engagement<br />tools, including mass email, SMS, IVR, etc.<br />* Ability and passion to operate at both strategic and tactical level &ndash; we need someone<br />who can help set and guide our interactive marketing strategies, as well as get their<br />hands dirty to execute specific projects.<br />* Top-notch collaboration skills &ndash; our company is growing fast and adding new people<br />every day. You must enjoy working with people in a variety of roles across multiple<br />departments to get the job done.<br />* You're a driven self-starter with positive outlook, flexible nature, and tenacious work<br />style that will fit well within OPOWER's hyper-growth environment.<br />&nbsp;<br /><strong>About OPOWER:</strong>&nbsp;<br />OPOWER is the market leader in applied behavioral science in the energy efficiency<br />space, engaging millions of consumers to reduce their energy usage with targeted,<br />multi-channel marketing campaigns. A patent-pending, customer-engagement<br />approach that leverages cutting-edge behavioral science, customer data analytics<br />and the latest software has made OPOWER one of the hottest startups in the country.<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;<br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"omnmVfwK","title":"Marketing Analyst","requisitionId":{},"category":"Consumer Marketing & Analysis","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"8/5/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=omnmVfwK","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=omnmVfwK","description":"<strong>About the Role:</strong><br /> OPOWER is looking for an energetic, super smart and highly quantitative analyst to help plan and assess&nbsp;our utility marketing programs that are the key to our growing success at driving large-scale energy&nbsp;savings. OPOWER is the market leader in applied behavioral science in the energy efficiency space,&nbsp;engaging millions of consumers to reduce their energy usage with targeted, multi-channel marketing&nbsp;campaigns. A patent-pending, customer-engagement approach that leverages cutting-edge behavioral&nbsp;science, customer data analytics and the latest software has made OPOWER one of the hottest startups&nbsp;in the country. &nbsp;<br /> This is an exciting opportunity to be a core part of the Consumer Marketing &amp; Analysis team that creates&nbsp;and manages these marketing strategies, and is constantly testing and researching new ideas to drive&nbsp;ever-improving results. &nbsp;<br /> In this role, you will be responsible for modeling the expected impact and cost-efficiency of planned&nbsp;marketing programs. You&rsquo;ll be the go-to analyst for the Client Solutions and Marketing teams, helping&nbsp;to develop our sales strategies, regulatory filings, and utility marketing documents. Your analysis will be&nbsp;central to the planning and design of new program launches. &nbsp;<br /> If you&rsquo;re excited by the idea of being part of a rapidly growing software company where you can put your&nbsp;analytical skills to use improving the planet, this may be the job for you.<br /> This position reports to the Director, Marketing Analytics, and will be based in our Arlington, VA office.<br /> &nbsp;<br /> <strong>Job Responsibilities:</strong><br /> &bull;Create and maintain a performance forecasting model customized for the idiosyncrasies of&nbsp;individual utility marketing programs; seamlessly integrate forecasting and pricing models<br /> &bull;Work closely with Client Solutions and Marketing teams to estimate program savings and cost&nbsp;effectiveness for new deployments and existing program expansion opportunities<br /> &bull;Synthesize quantitative and qualitative findings into informative and easy-to-understand&nbsp;presentations<br /> &bull;Serve as liaison between the Marketing Analytics and Client Solutions teams<br /> &bull;Add to the analytical horsepower that powers OPOWER&rsquo;s Insight Engine<br /> &nbsp;<br /> <strong>About You:</strong><br /> &bull;You have a bachelors degree in quantitative field from a top school<br /> &bull;0-2 years professional analytic experience<br /> &bull;You demonstrate wizardry with Excel and PowerPoint, and are open to learning some SQL<br /> &bull;You are interested in behavioral economics, the Smart Grid, and energy efficiency<br /> &bull;Your communication and presentation skills are first-class<br /> &bull;You can work quickly and error-free under tight deadlines with ever-changing requirements<br /> &nbsp;<br /> <strong>About the Company</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"opomVfwO","title":"Senior Manager of Marketing Analytics","requisitionId":{},"category":"Consumer Marketing & Analysis","jobtype":{},"location":"Arlington, VA, United States","date":"8/5/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=opomVfwO","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=opomVfwO","description":"<strong>About the Role:</strong><br /> OPOWER is looking for a strategic, energetic, super smart and highly analytic professional to drive the&nbsp;marketing insights and innovations that are the key to our growing success at driving large-scale energy&nbsp;savings. OPOWER is the market leader in applied behavioral science in the energy efficiency space,&nbsp;engaging millions of consumers to reduce their energy usage with targeted, multi-channel marketing&nbsp;campaigns. A patent-pending, customer-engagement approach that leverages cutting-edge behavioral&nbsp;science, customer data analytics and the latest software has made OPOWER one of the hottest startups&nbsp;in the country.<br /> This is an exciting opportunity to play a leadership role on the Consumer Marketing &amp; Analysis team that&nbsp;creates and manages these marketing strategies, and is constantly testing and researching new ideas to&nbsp;drive ever-improving results.<br /> In this role, you will drive ongoing innovation to improve the results from our Home Energy Report&nbsp;campaigns and Home Energy Web Portal through new marketing/engagement strategies, refined&nbsp;targeting, and algorithmic improvements. You will spearhead efforts to develop and deploy innovative&nbsp;product features across a range of utility clients through collaboration with our Product Development&nbsp;and Client Program Management teams. You will integrate findings from quantitative data analysis and&nbsp;qualitative consumer research to drive insights into customer motivation and behaviors. You will lead the&nbsp;R&amp;D efforts on Smart Grid data analysis with the aim of creating the killer app(s) for real-time energy use&nbsp;data streams.<br /> If you&rsquo;re excited by the idea of being part of a rapidly growing software company where you can put your&nbsp;analytical skills to use improving the planet, this may be the job for you.<br /> This position reports to the Director, Marketing Analytics, and will be based in our Arlington, VA office.<br /> &nbsp;<br /><strong> Job Responsibilities:<br /></strong> &bull;Drive the development, testing, and analysis of new strategies for improving the performance&nbsp;of our products: energy efficiency impact; email and website metrics; utility client program &nbsp;participation rates<br /> &bull;Create, maintain, and evangelize product learning agenda<br /> &bull;Partner with software development team to create new features to increase our impact, including&nbsp;the development of new analytic algorithms<br /> &bull;Lead the planning and design of tests we implement across our utility client programs<br /> &bull;Integrate quantitative findings with various consumer research activities<br /> &bull;Identify and assess new sources of data<br /> &bull;Develop cutting-edge techniques to leverage Smart Grid data streams as part of our analytics&nbsp;platform<br /> &bull;Actively recruit junior analysts and expand the capabilities of the Marketing Analytics team to&nbsp;support OPOWER&rsquo;s growth into new markets<br /> &nbsp;<br /> <strong>About You:</strong><br /> &bull;Bachelors degree with a quantitative focus (Econ/Finance, Engineering, Math/Physics, Statistics,&nbsp;Operations Research) and a solid record of academic achievement; MBA from a top 10 program&nbsp;is preferred<br /> &bull;You have 5-10 years of progressive experience involving business analysis in a professional&nbsp;setting (experience working for a top-tier management consulting firm such as McKinsey, Bain, or&nbsp;BCG is a plus)<br /> &bull;You have a natural strength and passion for turning analytic insights into high-impact actionable strategies,aand proven results that back the nuggetsup in this regard from large complex data<br /> &bull;You have demonstrated ability to find your ability of useful insight&nbsp;sets, and to communicate those findings to executives and various external audiences<br /> &bull;You&rsquo;re a driven self-starter with positive outlook, flexible nature, and tenacious work style that will&nbsp;fit well within OPOWER&rsquo;s hyper-growth environment<br /> &bull;Your communication and presentation skills are first-class<br /> &bull;Basic understanding of SQL, familiarity with a statistical software is strongly preferred, and&nbsp;&ldquo;wizard level&rdquo; Excel skills are required<br /> &nbsp;<br /> <strong>About the Company:</strong><br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency&nbsp;by empowering residential consumers to make better decisions on their energy usage. Through a&nbsp;combination of home energy reports, carbon calculators, web applications, data analytics, and customer&nbsp;service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented&nbsp;energy savings across hundreds of thousands of households. The company is well funded and making&nbsp;big headlines as they stay on track to reach two million households by the end of 2010 and save enough&nbsp;energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR&nbsp;RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL<br /> YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"o0QlVfwQ","title":"VP Consumer Marketing & Analytics","requisitionId":{},"category":"Consumer Marketing & Analysis","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o0QlVfwQ","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o0QlVfwQ","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> &nbsp;<br /> <strong>About the Job</strong><br /> &nbsp;<br /> OPOWER is looking for a Vice President to lead the Consumer Marketing and Analytics organization that creates energy savings results for OPOWER&rsquo;s client base through targeted, multi-channel marketing campaigns.&nbsp; A patent-pending, customer-engagement approach that leverages cutting-edge behavioral science, customer data analytics and the latest software to engage millions of utilities customers has made OPOWER one of the hottest startups in the country.&nbsp;This role offers the right marketing leader an opportunity to reduce global carbon emissions by marshalling resources that include world-class test-cell marketing, the greatest storehouse of Smart Grid consumer data on the market, and an expanding set of interactive marketing tools.&nbsp; We are looking for a first-rate leader, people manager, and consumer marketing innovator who can take OPOWER&rsquo;s Consumer Marketing and Analytics team to the next level during an exciting period of hyper-growth at the company.<br /> &nbsp;<br /> OPOWER is already having tremendous success engaging nearly 1 million enrolled energy utility customers with our direct mail Home Energy Reports, and there is a great untapped opportunity to drive additional energy-saving action through interactive channels.&nbsp; The VP, Consumer Marketing and Analytics, will lead a team of:<br /> <ul> <li> Interactive marketing professionals, charged with raising OPOWER&rsquo;s energy savings impact via an aggressive innovation and testing agenda across multiple channels: email, text, IVR, social media, as well as SEM and online advertising</li> <li> Marketing analytics experts and program evaluators who refine targeting, individualized messaging, and algorithmic improvements behind a test-cell marketing approach that optimizes the impact of our paper Home Energy Reports and identifies new ways to leverage cutting-edge energy use data streams from the Smart Grid</li> <li> Marketing communications specialists who ensure that all direct mail and web portal content is clear, compelling, and driving recipients to energy saving action</li> </ul> In this role, you and your team will work closely with the Software Product Management team to ensure we have the right infrastructure and capabilities in place to support your strategies, and with the Program Managers who directly manage the relationships with the utility clients for whom we&rsquo;re running marketing campaigns.&nbsp; Keys to success will include hiring and managing the right team of supporting resources, and also ensuring that OPOWER has the right infrastructure and tools in place to execute strategies across the varied interactive channels.<br /> &nbsp;<br /> This position reports to the SVP, Consumer Marketing and Operations.<br /> <br /> <strong>About You</strong><br /> <ul> <li> Bachelors degree with a quantitative focus and a solid record of academic achievement, MBA or comparable graduate degree from a top 10 program is preferred</li> <li> 10+ years consumer marketing experience, with heavy emphasis on interactive marketing channels and direct marketing campaigns</li> <li> You are highly analytic by nature, and have a passion for turning analytic insights into high-impact actionable strategies; ideally, you have direct experience running test-cell marketing campaigns and you are adept at applying statistical measures to drive insights and action steps</li> <li> You have worked within the marketing organization of a start-up before; you&rsquo;re a driven self-starter with positive outlook, flexible nature, and tenacious work style that will fit well within OPOWER&rsquo;s hyper-growth environment</li> <li> You have demonstrated success at building and leading integrated interactive consumer marketing strategies, preferably in an ongoing customer relationship context</li> <li> You are passionate about consumer marketing and are always up on new technologies that enable more powerful engagement with the customer</li> <li> You have a proven sustained track record of direct response results via both mail and interactive marketing channels: email, text, IVR, social media, SEM, and online advertising</li> <li> You are familiar with the industry-leading tools for managing interactive channels, and are both able and eager to understand the underlying technology</li> <li> You have the drive and creativity to adapt strategies that push the envelope, but also fit within real-world implementation constraints</li> <li> You have experience and strong ability to work directly with agencies, copywriters, designers</li> <li> Your communication and collaboration skills are world class, and you have the work product examples and professional references to back it up</li> </ul> <strong>About the Company</strong><br /> <br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> <br /> NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"oqPgVfwa","title":"Sales Executives (Arlington, VA)","requisitionId":{},"category":"Sales/Business Development","jobtype":{},"location":"Arlington, VA, United States","date":"6/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oqPgVfwa","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oqPgVfwa","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><strong>About the Job:</strong><br />We are specifically looking for a Sales Executive in the Northeast or Midwest. The ideal candidate will initiate, develop and secure relationships with Utility customers for the delivery of OPOWER's core analytics, reporting, and behavioral insight products. We are looking for an experienced sales person who is smart with high-horsepower, who has proven experience growing new and exciting account revenue with 7 figure deals, and who has experience selling directly to large, complex organizations (particularly utilities).<br />There is a clear expectation for the Sales Executives to demonstrate specific and current domain expertise, which can be leveraged from day one to quickly build a strong business pipeline and to meet sales targets. Additionally, this person will be responsible for growing existing accounts. As a result, only candidates who meet the following baseline criteria will receive consideration for this role.<br /><em><strong>Minimum Requirements:</strong></em><br />- Minimum of 2 of the past 5 years direct sales experience to C-Level Executives and Energy Efficiency/Marketing program leadership at domestic public and private utilities.<br />- Ability to clearly articulate their understanding of the structure, decision making process, and market/regulatory influences within utility organizations.<br />- Clear track record of carrying challenging sales quotas and meeting/exceeding annual goals for innovative product/services offerings that are new to the market.<br />- Ability and desire to undertake extensive domestic travel in pursuit of meeting your goals and expanding OPOWER's client base.<br /><em><strong>Primary Responsibilities</strong></em><br />- Developing a robust and well-qualified business pipeline with Utilities clients.<br />- Identify, reach and influence key decision makers within targeted utility prospects.<br />- Work closely with senior executives to set strategies and execute on tactics for closing business with prospective clients.<br />- Serve as both \"Hunter\" and \"Consultative Sales Professional\" - often at the same time.<br />- Work with other Client Solutions team members to structure and propose detailed multi-year business relationships.<br />- Meet and exceed sales goals to help OPOWER reach its goals, while being well rewarded for your efforts.<br />&nbsp;<br /><strong>About You:</strong><br />- You have a BA/BS from a top university and/or a MBA.<br />- You love working with clients, understanding their personalities and their business needs, and delivering world-class programs to meet these needs.<br />- You thrive when given the opportunity to grow business with a client, and can set and execute on a multi-year growth strategy with the client.<br />- You have demonstrated the ability to manage and exceed expectations.<br />- You understand that customer service is critical to a client's satisfaction.<br />- \"Need to understand what the client is thinking and what their next move will be\" is what keeps you up at night.<br />- You function well in a fast-paced, informal environment where constant change is the norm and the bar for delivering results is set high.<br />- Traveling 30%-50% of the time to meet with your clients is where you'd rather be, instead of in the office.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"oqpkVfwO","title":"Director, Corporate Communications","requisitionId":{},"category":"Corporate Marketing and Strategy","jobtype":{},"location":"Arlington, VA, United States","date":"8/5/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oqpkVfwO","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oqpkVfwO","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than thirty utilities, including seven of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> &nbsp;<br /> <strong>About the Job:</strong><br /> OPOWER is looking for a Director of Marketing Communications to spearhead all company&rsquo;s external&nbsp;communication efforts. We&rsquo;re looking for a highly intelligent, energetic communications professional with&nbsp;a track record of building brand awareness and effectively executing a comprehensive communication&nbsp;strategy.<br /> This role offers the right individual a unique and exciting opportunity to deliver the next level of&nbsp;nationwide brand recognition for OPOWER. We are looking for an outstanding and passionate leader with&nbsp;outstanding written and verbal communications skill, and a track record of success in a fast-paced and dynamic&nbsp;environment.<br /> &nbsp;<br /> The Director of Communications will be responsible for promoting the next iteration of OPOWER&rsquo;s corporate&nbsp;brand and messaging with the goal to elevate the firm from a leading industry player to a national brand. The&nbsp;role will own and oversee all corporate communications, including PR, analysts relations, website updates,<br /> social media, emails newsletters, blogs and various corporate speaking appearances.<br /> &nbsp;<br /> This position reports to the Sr. Director, Marketing &amp; Strategy.<br /> <br /> <strong>About You:</strong><br /> <ul> <li>Bachelors degree with a strong record of academic achievement, MBA from a top program preferred but not required</li> <li>8+ years communications experience, preferably in clean-tech and/or enterprise software</li> <li>You are an outstanding writer and are able to communicate ideas creatively and concisely; you enjoy&nbsp;doing it and are energized by getting the message &ldquo;just right.&rdquo;</li> <li>You enjoy writing press releases; you are able to bring in examples of past work</li> <li>You have worked within the marketing organization of a start-up before; you&rsquo;re a driven self-starter&nbsp;with a positive outlook, flexible nature, and tenacious work style that will fit well within OPOWER&rsquo;s hyper-growth environment</li> <li>You have demonstrated success at building and leading a communications team &ndash; you&rsquo;re familiar with&nbsp;key performance indicators (KPIs) for a communications team and can quickly identify and address&nbsp;existing gaps</li> <li>You are passionate about looking for new ways to reach our audience</li> <li>You have extensive experience and a strong ability to work directly with agencies, copywriters, and&nbsp;designers</li> <li>Your communication and collaboration skills are world class</li> </ul> <strong>About the Company:</strong><br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"ospkVfwQ","title":"Director, Marketing Programs","requisitionId":{},"category":"Corporate Marketing and Strategy","jobtype":{},"location":"Arlington, VA, United States","date":"8/10/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=ospkVfwQ","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=ospkVfwQ","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than thirty utilities, including seven of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> &nbsp;<br /> &nbsp;<br /> <strong>About the Job:</strong><br /> OPOWER is looking for a Director of Marketing Programs to spearhead company&rsquo;s client acquisition strategy. &nbsp;We&rsquo;re looking for a creative business-to- business marketing professional with an impressive track record of developing and executing successful marketing programs and campaigns, with significant impact on company&rsquo;s revenue and market penetration. This role offers the right individual a unique and exciting opportunity to own the company&rsquo;s client outreach strategy and help the sales team drive rapid market penetration across the US and internationally.&nbsp; We are looking for a dynamic , high-bandwidth marketing professional with an outstanding project management skills, intimate familiarity with all available business-to-business marketing channels and strong understanding of &ldquo;what works.&rdquo;&nbsp;<br /> &nbsp;<br /> The Director of Marketing Program swill be responsible for auditing all existing programs and developing a new, comprehensive annual marketing plan and budget designed to fuel rapid market penetration. In addition, this role will assume the lead on all marketing programs, including conferences, events, direct mail campaigns, industry partnership and co-marketing initiatives as well as any digital campaigns via social media or email . The key metric of success will be successful sales lead generation in all US states and internationally.<br /> &nbsp;<br /> This position reports to the Sr. Director, Marketing &amp; Strategy.<br /> &nbsp;<br /> <strong>About You</strong><br /> <ul> <li>Bachelors degree with a solid academic record, leadership activities</li> <li>8+ years business-to-business marketing experience, with emphasis on direct client acquisition programs</li> <li>You have a deep passion for understanding your audience, creating the right message and winning new business </li> <li>You are highly energetic, high-bandwidth project management with outstanding leadership skills</li> <li>You have developed and executed numerous marketing campaigns through a variety of communication channels; you have strong opinions on what works, and are familiar with best practices in business-to-business marketing</li> <li>You have worked within the marketing organization of a start-up before; you&rsquo;re a driven self-starter with positive outlook, flexible nature, and tenacious work style that will fit well within OPOWER&rsquo;s hyper-growth environment</li> <li>You are passionate about marketing communications and are always up on new ways to reach our audience</li> <li>Your communication and collaboration skills are world class. </li> </ul> <strong>About the Company:</strong><br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"o0AmVfwB","title":"Director of Policy","requisitionId":{},"category":"Government Affairs","jobtype":{},"location":"Arlington, VA, United States","date":"8/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o0AmVfwB","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o0AmVfwB","description":"&nbsp;<br /> <strong>About the Job:</strong><br /> The Director of Policy at OPOWER&nbsp;will&nbsp;work&nbsp;with&nbsp;the&nbsp;Senior Director&nbsp;of&nbsp;Government&nbsp;Affairs&nbsp;to use policy to increase the market for information-based energy efficiency.<br /> &nbsp;<br /> The person in this role will creatively expand OPOWER&rsquo;s presence in the policy community, lay the groundwork for increased efficiency standards, and get results.&nbsp; The Director of Policy will need to be able to develop relationships with thought leaders, build and lead coalitions of businesses with similar interests, and create alliances with state policy leaders.&nbsp; The goal is to influence policy &ndash; and expand the market for efficiency &ndash; both federally, and in the states.<br /> &nbsp;<br /> This is an ideal job for a born networker who knows &ndash; or wants to learn &ndash; all about energy policy.&nbsp; The right candidate is smart, persuasive, personable, and able to move others with his or her insight and passion.<br /> &nbsp;<br /> <strong>Responsibilities:</strong><br /> <ul> <li> Own and deepen relationships with non-profit advocates and think tanks.&nbsp; Examples include (but are not limited to): ACEEE, NRDC, ASE, EDF, Gridwise Alliance, Efficiency First, etc.</li> <li> Build or find the coalition that can effectively advocate for information based efficiency.</li> <li> Seed and possibly author white papers that will influence policy decisions in the states.</li> <li> Create a network of efficiency champions.</li> <li> Shape policy thinking nationwide about best practices for Smart Grid implementations.</li> <li> Do all of the above &ndash; and more &ndash; with an eye on measurably increasing the market for OPOWER&rsquo;s products.</li> </ul> <strong> </strong><br /> <strong>About You:</strong><br /> <ul> <li> You have BA/BS from a top university, and at least six years&nbsp;of&nbsp;work&nbsp;experience. &nbsp;You do not need to have policy experience, but you must be able to demonstrate that you understand how policy is made and can persuade policy makers. &nbsp;</li> <li> Graduate education, either in law or public policy, is a plus but not required.</li> <li> You are a born networker.</li> <li> You love policy and either already are, or are ready to become, an energy expert.</li> <li> You function well in a fast-paced, informal, team-focused environment where constant change is the norm and the bar for quality is set high</li> <li> You thrive on responsibility, and need only minimal direction to excel at your work.</li> </ul> <strong>About the Company:</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /> &nbsp;<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oi3jVfwj","title":"Director, Government Affairs - East Coast","requisitionId":{},"category":"Government Affairs","jobtype":{},"location":"Arlington, VA, United States","date":"8/6/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oi3jVfwj","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oi3jVfwj","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br /> &nbsp;<br /> <strong>About the Job</strong><br /> &nbsp;<br /> As&nbsp;the Director, Government Affairs at OPOWER&nbsp;you&nbsp;will&nbsp;work&nbsp;with&nbsp;the&nbsp;Senior Director&nbsp;of&nbsp;Government&nbsp;Affairs&nbsp;to strategically analyze the regulatory landscape as it affects energy efficiency, reach out to utility commissioners and other stakeholders, and use the regulatory process to expand OPOWER&rsquo;s market.<br /> <br /> Our clients are Fortune 1000 companies with complex businesses, who partner with us because of our cutting-edge technology, world-class team, and, increasingly, the desire to get regulatory recognition for our efficiency results.<br /> <br /> This is an ideal job for an experienced government relations or political professional who is able to tackle energy efficiency regulation both in person and through regulatory comments and filings.&nbsp;&nbsp; Great writing, research, and people skills are a must. This role will involve travel 20-40% of the time, including to the west coast.&nbsp; This role will be based at our headquarters in Arlington, VA.<br /> &nbsp;<br /> <strong>Responsibilities </strong><br /> <ul> <li>Set up and present at meetings with public utility commissioners (and wow them).</li> <li>Analyze and provide insight on the regulatory and legislative landscape in which our clients operate.</li> <li>Author comprehensive, accurate and professional filings and comments&nbsp;that will enable regulators and staff to understand and accept our business model.</li> <li>Lead our sales team past political and regulatory hurdles.</li> <li>Work with other stakeholders, including our utility clients, non-profits, and public advocates to promote understanding of and regulatory acceptance for our model.</li> </ul> <strong>About You</strong><br /> <ul> <li>You have BA/BS from a top university.&nbsp;&nbsp;And at least six years&nbsp;of&nbsp;work&nbsp;experience&nbsp;in&nbsp;either government/ regulatory affairs or politics. Graduate level education a plus.</li> <li>You have the smarts and persistence to navigate through complex regulatory approval processes </li> <li>You already are or are ready to become a world class expert on state energy policy</li> <li>You are detail-oriented, hard working, and organized.&nbsp; </li> <li>You function well in a fast-paced, informal, team-focused environment where constant change is the norm and the bar for quality is set high</li> </ul> <strong>About the Company</strong><br /> <br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> &nbsp;<br /> NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /> &nbsp;<br /> NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oYrmVfwq","title":"Director, Government Affairs - West Coast","requisitionId":{},"category":"Government Affairs","jobtype":{},"location":"San Francisco, CA, United States","date":"8/6/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oYrmVfwq","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oYrmVfwq","description":"<br /> Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br />&nbsp;<br /><strong>About the Job</strong><br />&nbsp;<br />As&nbsp;the Director, Government Affairs at OPOWER&nbsp;you&nbsp;will&nbsp;work&nbsp;with&nbsp;the&nbsp;Senior Director&nbsp;of&nbsp;Government&nbsp;Affairs&nbsp;to strategically analyze the regulatory landscape as it affects energy efficiency, reach out to utility commissioners and other stakeholders, and use the regulatory process to expand OPOWER&rsquo;s market.<br /><br />Our clients are Fortune 1000 companies with complex businesses, who partner with us because of our cutting-edge technology, world-class team, and, increasingly, the desire to get regulatory recognition for our efficiency results.<br /><br />This is an ideal job for an experienced government relations or political professional who is able to tackle energy efficiency regulation both in person and through regulatory comments and filings.&nbsp;&nbsp; Great writing, research, and people skills are a must. This role will involve travel 20-40% of the time, including to the west coast.&nbsp; This role will be based in our San Francisco office.<br />&nbsp;<br /><strong>Responsibilities&nbsp;</strong><br /> <ul> <li>Set up and present at meetings with public utility commissioners (and wow them).</li> <li>Analyze and provide insight on the regulatory and legislative landscape in which our clients operate.</li> <li>Author comprehensive, accurate and professional filings and comments&nbsp;that will enable regulators and staff to understand and accept our business model.</li> <li>Lead our sales team past political and regulatory hurdles.</li> <li>Work with other stakeholders, including our utility clients, non-profits, and public advocates to promote understanding of and regulatory acceptance for our model.</li> </ul> <strong>About You</strong><br /> <ul> <li>You have BA/BS from a top university.&nbsp;&nbsp;And at least six years&nbsp;of&nbsp;work&nbsp;experience&nbsp;in&nbsp;either government/ regulatory affairs or politics. Graduate level education a plus.</li> <li>You have the smarts and persistence to navigate through complex regulatory approval processes</li> <li>You already are or are ready to become a world class expert on state energy policy</li> <li>You are detail-oriented, hard working, and organized.&nbsp;</li> <li>You function well in a fast-paced, informal, team-focused environment where constant change is the norm and the bar for quality is set high</li> </ul> <strong>About the Company</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"o1rmVfwt","title":"Senior User Experience Researcher","requisitionId":{},"category":"Design/UX","jobtype":{},"location":"Arlington, VA, United States","date":"8/6/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o1rmVfwt","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o1rmVfwt","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team! <br /> <br /><strong>About the job:<br /></strong>As Senior User Experience Researcher you will lead design research efforts for OPOWER products designed to motivate and educate consumers to reduce their home energy use. We strive to create the most intuitive, useful products in the market, and user research is an essential part of our development process. You will work with the User Experience and Product teams to drive research projects both in-house and across the country, translate research insights into actionable design recommendations, and communicate findings to the team and the company. We will look to you to see the big picture across all of our research efforts and maintain a prioritized summary of high-level insights. Being able to understand design, business needs and the product development process will be an important part of the role. This is an ideal job for a researcher with 7+ years of experience who wants to be part of a rapidly growing startup, work hard at achieving a dramatic success in a vibrant market, and have millions of people benefit from the results of your work. This role will report to the Senior Manager of User Experience.<br /><br /><strong>About you:</strong><br /> <ul> <li>You have at least 6 years of relevant work experience, including knowledge of a wide range of qualitative research methods such as contextual inquiry, participatory design, diary studies, cultural probes, lab-based usability studies, etc. Quantitative research experience a plus.</li> <li>You have a successful history of uncovering valuable insights from user research and translating them to actionable product development strategies. </li> <li>You understand design and what types of insights are helpful for designers.</li> <li>You&rsquo;re passionate about talking with people and understanding their needs.</li> <li>You are a strategic and big-picture thinker.</li> <li>You can tell a clear, powerful story, and your presentation skills are top notch.</li> <li>You thrive working in a collaborative, creative, fast-paced environment.</li> <li>Bachelors degree in design research, anthropology, human-computer interaction, &nbsp;behavioral sciences, or a related field preferred. Masters Degree is a big plus. Experience with software development process also a plus.</li> <li>A portfolio demonstrating the above qualities is required.</li> </ul> <br /><strong>Responsibilities:</strong><br /> <ul> <li>Designing and conducting ethnographic research and usability studies</li> <li>Setting up recruiting, creating test plans, phone screeners, and discussion guides</li> <li>Analyzing, synthesizing, and articulating actionable research results for the product development team</li> <li>Maintaining a library of key insights that spans all of our research</li> <li>Helping to define personas and design principles for our products</li> </ul> <br /><strong>About the Company:<br /></strong>Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through<br /> a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"o3AkVfwC","title":"Associate Professional Services Engineer","requisitionId":"Critical Hire","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o3AkVfwC","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o3AkVfwC","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br />&nbsp;<br /><strong>About the Job</strong><br />&nbsp;<br />OPOWER is looking for smart and driven engineers who are technically skilled, detail oriented, and desire to work on meaningful, large-scale energy efficiency software deployments. Every energy utility company that utilizes OPOWER&rsquo;s energy efficiency software receives a configured and deployed instance of OPOWER&rsquo;s software application, and the Associate Professional Services Engineer plays a critical role in building, customizing, deploying, maintaining, and ultimately expanding this energy efficiency program for the utility.<br />&nbsp;<br />We are looking for individuals with a solid, broad base of technical fundamentals who are seeking a high-paced, dynamic environment in which to expand and hone their arsenal of technical skills.<br />&nbsp;<br />Associate Professional Services Engineers rely on a diverse technical skill-set, including, but not limited to, writing complex SQL queries, comfort on the Linux command line, shell scripting, and a high-level programming language such as Java.&nbsp; Associate Professional Services Engineers are not expected immediately to be masters of the full spectrum of technologies used, but are expected to quickly become technical gurus and masters of all skills required to launch energy efficiency programs for new utility clients.&nbsp; Setting up new efficiency programs for our utility clients is the lifeblood of OPOWER and the Associate Professional Services role is critical to OPOWER&rsquo;s success.<br />&nbsp;<br />The Associate Professional Services Engineer works closely with a team of OPOWER employees to deliver SAAS-based energy efficiency programs on behalf of utilities, including a Program Manager, a Senior Professional Services Engineer, as well as members of the software product and QA teams.<br />&nbsp;<br /><strong>Responsibilities</strong><br /> <ul> <li>Communicate with the IT resources of the utility company client to explain requirements and coordinate proper transfer of utility data</li> <li>Analyze, transform, and load utility data from the utility clients</li> <li>Integrate utility data with additional data from various 3rd party sources to generate a holistic customer profile</li> <li>Configure and customize OPOWER&rsquo;s energy efficiency software to meet the specific needs of each client</li> <li>Maintain and provide escalated support for the utility energy efficiency programs after launch for the duration of the utility contract</li> <li>Expand the energy efficiency programs from pilot phase to large scale rollout</li> </ul> <strong>About You</strong><br /> <ul> <li>You have a computer-related technical degree and one to three years of recent, hands-on technical experience</li> <li>You are a perfectionist with a knack for sniffing out issues and solving them</li> <li>You are comfortable writing SQL and have recent experience with relational databases, MySQL preferred</li> <li>You have experience in Linux and are not afraid of the command line</li> <li>You demonstrate some programming knowledge (most of our code is in Java, but Ruby, Perl, Python, even VBA have their places too)</li> <li>You are a smart, talented, diamond-in-the-rough engineer, looking for an exciting, high-paced company to expand your toolbox and master your skills.</li> <li>Strong verbal and written communication skills are a strict requirement of the Associate Professional Services Engineer</li> </ul> <strong>About the Company</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oALhVfwh","title":"Director of Engineering - East Coast","requisitionId":{},"category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/30/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oALhVfwh","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oALhVfwh","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job&nbsp;:</strong><br />As a Director of Engineering at OPOWER, you will be a part of a talented engineering team that is passionate about the technology they use and the products that they build.&nbsp; You will work in a startup environment that uses Agile development methodologies to successfully deliver software that is used by millions of customers on a monthly basis. &nbsp;<br />&nbsp;<br />We are seeking a sharp, driven, talented Director of Engineering that enjoys building useful products that make a difference in people's lives.&nbsp; This is an ideal job for a someone with a strong technical aptitude and a track record of driving projects to successful completion who wants to be part of a rapidly growing startup.&nbsp;<br />&nbsp;<br /><strong>&nbsp;</strong><br /><strong>Responsibilities:</strong><br />* Technical vision -- provide excellent technical leadership, inspiring your team to build cutting-edge solutions and proactively bringing new ideas, technologies, and methodologies to the table.<br />* Evaluate technologies -- work closely with our Chief Software Architect to evaluate new key technologies and infrastructure investments, always looking three moves ahead to make both near-term and long-term optimal choices.<br />&nbsp;<br />* Synthesize priorities -- Work collaboratively with leads from Product Management, Operations, Sales and Marketing to internalize business needs and drive priorities for the team.&nbsp;<br />&nbsp;<br />* Scheduling -- prioritize projects, set achievable, motivating, stretch goals,&nbsp; and manage the team to hitting the deadlines<br />* Hiring -- find, recruit, and hire the very best * Engineering leader -- you are a lead voice on engineering in the organization.&nbsp; Be a great representative for the company and on the management team.<br /><strong>&nbsp;</strong><br /><strong>About You:</strong><br />* You have 10+ years leading engineering teams at software development companies (not in IT departments)<br />* You have strong experience leading Agile development teams<br />* You have some experience working with our technology stack (java, web, relational db) or similar<br />* You have solved significant technology scaling challenges<br />* You have strong management experience at a previous company leading a team of talented engineers<br />&nbsp;<br />* You have worked at a startup or very significant growth environment before<br />* You are effective at balancing the needs of a dynamic product roadmap, and managing a set of distinct teams with differing directives<br />* You have a passion for technology and expertise that will allow you to drive decisions in software architecture, infrastructure support, security and scalability.&nbsp; (Open Source technologies are preferred.)<br />* You are a doer and a leader who can shift from one role to another as your team grows<br />* You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /><br />NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /><br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oaFjVfwN","title":"Director of Engineering - West Coast","requisitionId":"Critical Hire","category":"Engineering","jobtype":{},"location":"San Francisco, CA, United States","date":"7/30/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oaFjVfwN","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oaFjVfwN","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job&nbsp;:</strong><br />As a Director of Engineering at OPOWER, you will be a part of a talented engineering team that is passionate about the technology they use and the products that they build.&nbsp; You will work in a startup environment that uses Agile development methodologies to successfully deliver software that is used by millions of customers on a monthly basis. &nbsp;<br />&nbsp;<br />We are seeking a sharp, driven, talented Director of Engineering that enjoys building useful products that make a difference in people's lives.&nbsp; This is an ideal job for a someone with a strong technical aptitude and a track record of driving projects to successful completion who wants to be part of a rapidly growing startup.&nbsp;<br />&nbsp;<br /><strong>&nbsp;</strong><br /><strong>Responsibilities:</strong><br />* Technical vision -- provide excellent technical leadership, inspiring your team to build cutting-edge solutions and proactively bringing new ideas, technologies, and methodologies to the table.<br />* Evaluate technologies -- work closely with our Chief Software Architect to evaluate new key technologies and infrastructure investments, always looking three moves ahead to make both near-term and long-term optimal choices.<br />&nbsp;<br />* Synthesize priorities -- Work collaboratively with leads from Product Management, Operations, Sales and Marketing to internalize business needs and drive priorities for the team.&nbsp;<br />&nbsp;<br />* Scheduling -- prioritize projects, set achievable, motivating, stretch goals,&nbsp; and manage the team to hitting the deadlines<br />* Hiring -- find, recruit, and hire the very best * Engineering leader -- you are a lead voice on engineering in the organization.&nbsp; Be a great representative for the company and on the management team.<br /><strong>&nbsp;</strong><br /><strong>About You:</strong><br />* You have 10+ years leading engineering teams at software development companies (not in IT departments)<br />* You have strong experience leading Agile development teams<br />* You have some experience working with our technology stack (java, web, relational db) or similar<br />* You have solved significant technology scaling challenges<br />* You have strong management experience at a previous company leading a team of talented engineers<br />&nbsp;<br />* You have worked at a startup or very significant growth environment before<br />* You are effective at balancing the needs of a dynamic product roadmap, and managing a set of distinct teams with differing directives<br />* You have a passion for technology and expertise that will allow you to drive decisions in software architecture, infrastructure support, security and scalability.&nbsp; (Open Source technologies are preferred.)<br />* You are a doer and a leader who can shift from one role to another as your team grows<br />* You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /><br />NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /><br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"o9XkVfw5","title":"Lead Software Engineers - East Coast","requisitionId":{},"category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"6/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o9XkVfw5","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o9XkVfw5","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job:</strong><br />Are you tired of large corporate or government environments? Would you like to work on the OS of your choice? To have a smart and talented team to work with and have weekly code reviews with? Do you love to build products that have significant impact on a wider scale? Would you prefer to use Open Source tools and to work in a casual environment with free lunches and monthly happy hours? If you say \"yes\" to any of these questions, then keep reading! You can at OPOWER! We are seeking smart and talented software engineers that enjoy problem-solving and building useful products that make a difference in people's lives.<br />You will work across the entire technology stack and be fully responsible for what you build -- from design to implementation to deployment to maintenance. You will write elegant, maintainable, robust, scalable code every day.<br />This is an IDEAL job for an engineer with 8 plus years of experience who wants to guide a small team, feel total ownership over their work, and code like a ninja to make this a raging success. We are seeking a developer who is equally comfortable with front and back end development.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&bull; Lead a team to design and implement features of our product suite.<br />&bull; Code in Java using open-source technologies.<br />&bull; Contribute to the improvement of our software development process.<br />&bull; Analyze requirements of projects and collaborate with other software engineers during the design phase.<br />&nbsp;<br /><strong>About You:</strong><br /> &bull; You are a leader who began as a developer who somehow always manages to get 10 times more done than your peers.<br /> &bull; The idea of owning a large portion of a codebase gives you shivers of joy.<br />&bull; You are hands on, detail-oriented, methodical, a perfectionist and work well with others.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You have 8 plus years of software development experience and you are strong in Java, HTML, CSS and SQL.<br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still.<br />&bull; Linux and shell scripts are your friends.<br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"ocXkVfw8","title":"Lead Software Engineers - West Coast","requisitionId":{},"category":"Engineering","jobtype":"Full-Time","location":"San Francisco, CA, United States","date":"6/17/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=ocXkVfw8","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=ocXkVfw8","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job:</strong><br />Are you tired of large corporate or government environments? Would you like to work on the OS of your choice? To have a smart and talented team to work with and have weekly code reviews with? Do you love to build products that have significant impact on a wider scale? Would you prefer to use Open Source tools and to work in a casual environment with free lunches and monthly happy hours? If you say \"yes\" to any of these questions, then keep reading! You can at OPOWER! We are seeking smart and talented software engineers that enjoy problem-solving and building useful products that make a difference in people's lives.<br />You will work across the entire technology stack and be fully responsible for what you build -- from design to implementation to deployment to maintenance. You will write elegant, maintainable, robust, scalable code every day.<br />This is an IDEAL job for an engineer with 8 plus years of experience who wants to be guide a small team, feel total ownership over their work, and code like a ninja to make this a raging success. We are seeking a developer who is equally comfortable with front and back end development.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&bull; Lead a team to design and implement features of our product suite.<br />&bull; Code in Java using open-source technologies.<br />&bull; Contribute to the improvement of our software development process.<br />&bull; Analyze requirements of projects and collaborate with other software engineers during the design phase.<br />&nbsp;<br /><strong>About You:</strong><br /> &bull; You are a leader who began as a developer who somehow always manages to get 10 times more done than your peers.<br /> &bull; The idea of owning a large portion of a codebase gives you shivers of joy.<br />&bull; You are hands on, detail-oriented, methodical, a perfectionist and work well with others.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You have 8 plus years of software development experience and you are strong in Java, HTML, CSS and SQL.<br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still.<br />&bull; Linux and shell scripts are your friends.<br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oZMiVfwI","title":"MySQL Database Architect","requisitionId":"Critical Hire","category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"8/5/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oZMiVfwI","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oZMiVfwI","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> &nbsp;<br /> About the Job<br /> &nbsp;<br /> We need a top-notch Database Architect to work with the Chief Software Architect and the engineering team to design and build the next evolution of our already successful product. &nbsp;This job will give you an opportunity to work on projects integral to our future success, such as a scalable batch-oriented system for running our report generation, helping to build a large-scale real-time data warehouse, and a feature roadmap that goes through the end of 2012.<br /> <br /> To be successful at this job, you will need to balance being a visionary with the practical requirements of evolving a fully deployed application. &nbsp;This is absolutely a hands-on job.<br /> &nbsp;<br /> - Design and development of application software<br />- Guide the database architecture and our database development practices<br />- Play a key role in scaling our product well beyond current capacity<br />- Monitor usage patterns, identify potential issues and tune performance<br />- Participate in code reviews to identify potential improvements<br />- Mentor and coach team members<br />- Keep up-to-date on technology developments with an eye for potential use in house<br />- Contribute to the overall improvement of our agile development process<br /><br />About You<br />- You have 7+ years database design and architecture, data modeling, security, performance tuning experience<br />- You have 2+ years in the role of architect<br />- You have 2+ years working with MySQL<br />- You are an expert with SQL and Stored Procedures<br />- You have a strong track record of scaling existing solutions 5-10x<br />- You have a strong track record putting together practices, processes and tools to raise the overall bar on database work<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /><br />NO PHONE CALLS, PLEASE. THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW. (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br /><br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"ocAkVfwL","title":"Professional Services Engineer","requisitionId":"Critical Hire","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=ocAkVfwL","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=ocAkVfwL","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job</strong>&nbsp;:<br />We are looking for smart and driven engineers who are detailed oriented and love building lasting solutions for customers. Professional Services Engineer create customized systems for customer deployments using OPOWER's Insight Engine product. Professional Services Engineer interface closely with our utility customers' technical points of contact and work very closely with OPOWER&rsquo;s software R&amp;D team. Your insights and interaction with our customers will exert great influence on the functionality and design of the product. Development is primarily done in OPOWER&rsquo;s office, with limited travel to client sites.<br />&nbsp;<br />Professional Services Engineer utilize a diverse technical skillset. We are looking for well-rounded engineers with extensive experience with SQL and designing and using large databases. &nbsp;Professional Services Engineer must have experience with Linux and be comfortable with shell scripting. It is a plus to have experience with a high-level programming language, (Java).&nbsp;<br />&nbsp;<br /><strong>Responsibilities:</strong>&nbsp;<br />&bull; Act as a liaison between client IT teams and OPOWER&rsquo;s software development team to customize the applications for customers.&nbsp;<br />&bull; Analyze, transform, and load the data from our utility company partners to ensure the highest quality imports into the reporting system.<br />&bull; Integrate utility data with other data from various 3rd party sources like demographic data providers and parcel data.<br />&bull; Own all technical aspects necessary for successful client customization and delivery to market.&nbsp;<br />&bull; Problem solving, task management, client delivery.&nbsp;<br />&nbsp;<br /><strong>About You</strong>&nbsp;:<br />&bull; You have a technical background and are a diverse multi-purpose engineer.<br />&bull; You have minimum 2 years of related experience.&nbsp;<br />&bull; You are a master of SQL/MySQL and databases (with knowledge of ETL concepts if not working experience)&nbsp;<br />&bull; Linux and shell scripts are your friends.&nbsp;<br />&bull; You demonstrate some programming knowledge (Java is a plus).<br />&bull; You are detail-oriented, methodical, and a perfectionist.<br />&bull; You love to surf through large amounts of data to find and explain anomalies.&nbsp;<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;<br /><br />&nbsp;<br />&nbsp;<br /><br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oHBgVfwd","title":"Senior Build Release Engineer","requisitionId":{},"category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/9/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oHBgVfwd","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oHBgVfwd","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br />About the Job:<br />We seek an outstanding Senior Build Release Engineer to lead our Release Engineering efforts.&nbsp; This person will design and manage our software configuration management system, build/deploy processes, and test/production environments.&nbsp; The ideal candidate will have experience coordinating and deploying application updates to mission critical enterprise systems.&nbsp;The engineer must have an command of formalized release management processes. The ability to trouble shoot and solve problems is critical.<br />&nbsp;<br /><br />Core Responsibilities:<br /> <ul> <li>Troubleshoot and resolve build, deployment and SCM problems</li> <li>Ensure the integrity of each release and confirm its proper configuration</li> <li>Automate release management processes</li> <li>Design, implement, and maintain software configuration / release scripts and processes</li> <li>Work with our Operations team to schedule and manage releases to Dev, Test and Production environments</li> <li>Develop and document configuration management and deployment strategy</li> </ul> &nbsp;<br />&nbsp;About You:<br /> <ul> <li>Genuine enjoyment of automation, configuration management, and deployment practices</li> <li>Desire for enormous ownership and impact in a young, fast-paced start-up</li> <li>Proficiency using Software Configuration Management tools (Subversion preferred)</li> <li>Expertise branching, merging, tagging, and managing the release of production applications</li> <li>Comfortable with the Unix command line</li> <li>Proficiency with Maven</li> <li>Scripting experience -- one or more of: shell, ruby, python, perl</li> <li>Relational database knowledge and experience writing SQL scripts (MySQL would be a bonus)</li> <li>Continuous Integration install and configuration experience (e.g. Hudson, CruiseControl, Bamboo)<br /></li> <li>Java Application server (e.g. Jetty/Tomcat/JBoss) install and configuration experience</li> <li>Apache web server install and configuration experience<br /></li> <li>Exceptional critical thinking and problem solving skills</li> <li>Professional, positive attitude, strong work ethic, great communication skills, and ability to work as a team</li> </ul> <br />About the Company:<br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> &nbsp;<br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"odAkVfwM","title":"Senior Professional Services Engineer","requisitionId":{},"category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"6/22/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=odAkVfwM","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=odAkVfwM","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br />&nbsp;<br /><strong>About the Job</strong><br /><br />OPOWER is looking for smart, driven, and experienced engineers who are technically skilled, detail oriented, and desire to work on meaningful, large-scale energy efficiency software deployments .&nbsp; Every energy utility company that utilizes OPOWER&rsquo;s energy efficiency software receives a configured and deployed instance of OPOWER&rsquo;s software application, and the Senior Professional Services Engineer plays the lead role in building, customizing, deploying, maintaining, and ultimately expanding the energy efficiency program for the utility.<br />&nbsp;<br />We are looking for Senior Professional Services Engineers with significant experience and expertise across a broad base of technologies who are seeking a fast-paced, dynamic environment in which to utilize their arsenal of skills.&nbsp;&nbsp; In addition to rapidly becoming experts at customizing and launching OPOWER&rsquo;s energy efficiency software, Senior Professional Services Engineers are expected to use their skills and acquired institutional knowledge to design and build internal tools and processes with the aim of increasing the scalability, efficiency, and reliability of the customization and deployment process.&nbsp; Additionally, OPOWER is growing rapidly and Senior Professional Services Engineers are expected to train and mentor less experienced Associate Professional Services Engineers.<br />&nbsp;<br />Senior Professional Services Engineers rely on a diverse technical skillset, including, but not limited to: mastery of SQL and database management, significant experience on the Linux command line, experience with bash and/or perl scripting, and a high-level programming language such as Java.<br />&nbsp;<br />The Senior Professional Services Engineer is a critical member of the team of OPOWER employees who deliver OPOWER&rsquo;s SaaS-based energy efficiency programs on behalf of utility customers, including a Program Manager, an Associate Professional Services Engineer, as well as members of the software product and QA teams.&nbsp; Strong verbal and written communication skills are a strict requirement of the Senior Professional Services Engineer.<br />&nbsp;<br />Setting up new efficiency programs for our utility clients is the lifeblood of OPOWER and the Senior Professional Services Engineer role is critical to OPOWER&rsquo;s continued success.<br />&nbsp;<br /><strong>Responsibilities</strong><br /> <ul> <li>Own the relationship with the IT resources of the utility company client and be ultimately responsible for ensuring a high quality data stream from the utility</li> <li>Analyze, transform, and load utility data from the utility clients</li> <li>Integrate utility data with additional data from various 3rd party sources to generate a holistic customer profile</li> <li>Configure and customize OPOWER&rsquo;s energy efficiency software to meet the specific needs of each client</li> <li>Maintain and provide escalated support for the utility energy efficiency programs after launch for the duration of the utility contract</li> <li>Expand the energy efficiency programs from pilot phase to large scale rollout</li> <li>Mentor and train Associate Professional Services Engineers</li> </ul> <strong>About You</strong><br /> <ul> <li>You have a computer-related technical degree and four to seven years of recent, relevant, and deep hands-on technical experience</li> <li>You live to write programs or scripts to automate tasks and increase efficiency</li> <li>You are a perfectionist with a knack for sniffing out issues and solving them</li> <li>You are a SQL guru and have extensive experience with large, relational databases, MySQL preferred</li> <li>You have significant and recent Linux experience and prefer the command line</li> <li>You have some high-level programming experience (most of our code is in Java, but Ruby, Perl, Python, even VBA have their places too)</li> <li>You are an experienced, high bandwidth engineer, looking for an exciting, high-paced company to further hone your skills and showcase your expertise.</li> </ul> <strong>About the Company</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"o6lkVfwq","title":"Senior Software Engineer in Test - East Coast","requisitionId":"Critical Hire SrQA1","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o6lkVfwq","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o6lkVfwq","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 4+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oBHfVfwc","title":"Senior Software Engineer in Test - East Coast","requisitionId":"Critical Hire SrQA2","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oBHfVfwc","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oBHfVfwc","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> <br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 4+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oNFjVfwq","title":"Senior Software Engineer in Test - West Coast","requisitionId":"Critical Hire SrQA3","category":"Engineering","jobtype":"Full-Time","location":"San Francisco, CA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oNFjVfwq","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oNFjVfwq","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> <br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 4+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oSQlVfwI","title":"Senior Software Engineers - East Coast","requisitionId":"Critical Hire SSWE5","category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/23/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oSQlVfwI","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oSQlVfwI","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job:</strong><br />Are you tired of large corporate or government environments? Would you like to work on the OS of your choice? To have a smart and talented team to work with and have weekly code reviews with? Do you love to build products that have significant impact on a wider scale? Would you prefer to use Open Source tools and to work in a casual environment with free lunches and monthly happy hours? If you say \"yes\" to any of these questions, then keep reading! You can at OPOWER! We are seeking smart and talented software engineers that enjoy problem-solving and building useful products that make a difference in people's lives.<br />You will work across the entire technology stack and be fully responsible for what you build -- from design to implementation to deployment to maintenance. You will write elegant, maintainable, robust, scalable code every day.<br />This is an IDEAL job for an engineer with 5-10 years of experience who wants to be part of a small team, feel total ownership over their work, and code like a ninja to make this a raging success. We are seeking a developer who is equally comfortable with front and back end development.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&bull; Design and implement features of our product suite.<br />&bull; Code in Java using open-source technologies.<br />&bull; Contribute to the improvement of our software development process.<br />&bull; Analyze requirements of projects and collaborate with other software engineers during the design phase.<br />&nbsp;<br /><strong>About You:</strong><br />&bull; You are a developer who somehow always manages to get 10 times more done than your peers.<br />&bull; The idea of owning a large portion of a codebase gives you shivers of joy.<br />&bull; You are detail-oriented, methodical, a perfectionist and work well with others.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You have 5-10 years of software development experience and you are strong in Java, HTML, CSS and SQL.<br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still.<br />&bull; Linux and shell scripts are your friends.<br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"ov6jVfwz","title":"Senior Software Engineers - West Coast","requisitionId":"Critical Hire SSWE3","category":"Engineering","jobtype":"Full-Time","location":"San Francisco, CA, United States","date":"6/17/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=ov6jVfwz","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=ov6jVfwz","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><br />About the Job:<br />We are looking for you -- a software engineer who wants to work in an environment where creativity is encouraged and rewarded; one who treats engineering as a discipline; a generalist who wants to contribute to all levels of the application, from the database to the client to the tools we use to build. You will write elegant, maintainable, robust, scalable code every day. This is an IDEAL job for an engineer who wants to be part of a small team, feel total ownership over their work, and code like a ninja to make this a raging success. <br /><br />We are headquartered in the Washington DC Metro area but are looking for a few great developers to start up our satellite office in the Palo Alto/Mountain View area. We are ready and willing to make a huge investment in that market, we just need the right talent to do so. Tag, you are IT! <br /><br />Responsibilities: <br />&bull; Collaborate on the design of our newest features <br />&bull; Implement those features in a robust and maintainable fashion <br />&bull; Write unit and integration tests to ensure those features never break <br /><br />About You: <br />&bull; You are a developer who somehow always manages to get 10 times more done than your peers <br />&bull; The idea of owning a large portion of a codebase gives you shivers of joy <br />&bull; You are detail-oriented, methodical, a perfectionist and work well with others <br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high <br />&bull; You have 5 - 10 years experience building database-backed applications in Java and can write SQL queries by hand <br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still <br />&bull; Linux and shell scripts are your friends <br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field. <br /><br />About the Company: <br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oEmkVfwZ","title":"Senior Software Engineers - West Coast","requisitionId":"Critical Hire SSWE4","category":"Engineering","jobtype":"Full-Time","location":"San Francisco, CA, United States","date":"6/17/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oEmkVfwZ","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oEmkVfwZ","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><br />About the Job:<br />We are looking for you -- a software engineer who wants to work in an environment where creativity is encouraged and rewarded; one who treats engineering as a discipline; a generalist who wants to contribute to all levels of the application, from the database to the client to the tools we use to build. You will write elegant, maintainable, robust, scalable code every day. This is an IDEAL job for an engineer who wants to be part of a small team, feel total ownership over their work, and code like a ninja to make this a raging success. <br /><br />We are headquartered in the Washington DC Metro area but are looking for a few great developers to start up our satellite office in the Palo Alto/Mountain View area. We are ready and willing to make a huge investment in that market, we just need the right talent to do so. Tag, you are IT! <br /><br />Responsibilities: <br />&bull; Collaborate on the design of our newest features <br />&bull; Implement those features in a robust and maintainable fashion <br />&bull; Write unit and integration tests to ensure those features never break <br /><br />About You: <br />&bull; You are a developer who somehow always manages to get 10 times more done than your peers <br />&bull; The idea of owning a large portion of a codebase gives you shivers of joy <br />&bull; You are detail-oriented, methodical, a perfectionist and work well with others <br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high <br />&bull; You have 5 - 10 years experience building database-backed applications in Java and can write SQL queries by hand <br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still <br />&bull; Linux and shell scripts are your friends <br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field. <br /><br />About the Company: <br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oQlkVfwa","title":"Software Architect","requisitionId":"Critical Hire SWARC0","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/20/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oQlkVfwa","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oQlkVfwa","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br /> &nbsp;<br /> &nbsp;<br /> We need a top-notch application architect to work with the Chief<br /> Software Architect and the engineering team to design and build the<br /> next evolution of our already successful product. &nbsp;This job will give<br /> you an opportunity to work on projects integral to our future success,<br /> such as a scalable batch-oriented system for running our report<br /> generation, redesigning how we deploy new clients on our system so we<br /> can push more through the process faster, and the application side of<br /> a large-scale real-time data warehouse.<br /> <br /> To be successful at this job, you will need to balance being a<br /> visionary with the practical requirements of evolving a fully deployed<br /> application. &nbsp;No building ESBs and SOAs because those happen to be the<br /> buzzwords of the enterprise. &nbsp;But if an ESB or an SOA is the best<br /> architecture for the solution, then bring your design chops and your<br /> coding skills to help us make that future a reality now. &nbsp;This is<br /> absolutely a hands-on job.<br /> <br /> Responsibilities:<br /> &nbsp;* Design and development of application software<br /> &nbsp;* Help guide our technical vision, application architecture and<br /> development practices<br /> &nbsp;* Participate in code reviews to identify potential improvements<br /> &nbsp;* Mentor and coach team members<br /> &nbsp;* Contribute to the overall improvement of our Agile development process<br /> &nbsp;* Act as a key technical representative outside the development team<br /> and outside the company<br /> <br /> About You:<br /> &nbsp;* 10-15 years of hands-on engineering experience<br /> &nbsp;* At least 5 years experience as architect, two of which must be on a<br /> single product<br /> &nbsp;* At least 1 year working in a fully Agile development environment<br /> &nbsp;* Expert with Java, Spring Framework, Hibernate, SQL, and strong with<br /> HTML/CSS/Javascript<br /> &nbsp;* Experience working with large data sets (at least 100s of gigabytes)<br /> &nbsp;* Expert technical communicator -- can explain design decisions and<br /> trade-offs to engineers of all experience levels<br /> &nbsp;* Strong desire and ability to teach other engineers the ways of the architect<br /> &nbsp;* Instincts to design for the future but build for today<br /> &nbsp;* Passionate about helping the team do it's best work<br /> &nbsp;<br /> &nbsp;<br /> <strong>About the Company</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"omOiVfw7","title":"Software Architect","requisitionId":"Critical Hire SWARC0","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"7/20/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=omOiVfw7","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=omOiVfw7","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br /> &nbsp;<br /> &nbsp;<br /> We need a top-notch application architect to work with the Chief<br /> Software Architect and the engineering team to design and build the<br /> next evolution of our already successful product. &nbsp;This job will give<br /> you an opportunity to work on projects integral to our future success,<br /> such as a scalable batch-oriented system for running our report<br /> generation, redesigning how we deploy new clients on our system so we<br /> can push more through the process faster, and the application side of<br /> a large-scale real-time data warehouse.<br /> <br /> To be successful at this job, you will need to balance being a<br /> visionary with the practical requirements of evolving a fully deployed<br /> application. &nbsp;No building ESBs and SOAs because those happen to be the<br /> buzzwords of the enterprise. &nbsp;But if an ESB or an SOA is the best<br /> architecture for the solution, then bring your design chops and your<br /> coding skills to help us make that future a reality now. &nbsp;This is<br /> absolutely a hands-on job.<br /> <br /> Responsibilities:<br /> &nbsp;* Design and development of application software<br /> &nbsp;* Help guide our technical vision, application architecture and<br /> development practices<br /> &nbsp;* Participate in code reviews to identify potential improvements<br /> &nbsp;* Mentor and coach team members<br /> &nbsp;* Contribute to the overall improvement of our Agile development process<br /> &nbsp;* Act as a key technical representative outside the development team<br /> and outside the company<br /> <br /> About You:<br /> &nbsp;* 10-15 years of hands-on engineering experience<br /> &nbsp;* At least 5 years experience as architect, two of which must be on a<br /> single product<br /> &nbsp;* At least 1 year working in a fully Agile development environment<br /> &nbsp;* Expert with Java, Spring Framework, Hibernate, SQL, and strong with<br /> HTML/CSS/Javascript<br /> &nbsp;* Experience working with large data sets (at least 100s of gigabytes)<br /> &nbsp;* Expert technical communicator -- can explain design decisions and<br /> trade-offs to engineers of all experience levels<br /> &nbsp;* Strong desire and ability to teach other engineers the ways of the architect<br /> &nbsp;* Instincts to design for the future but build for today<br /> &nbsp;* Passionate about helping the team do it's best work<br /> &nbsp;<br /> &nbsp;<br /> <strong>About the Company</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"o4lkVfwo","title":"Software Engineer in Test - East Coast","requisitionId":"Critical Hire QAEng2","category":"Engineering","jobtype":{},"location":"Arlington, VA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o4lkVfwo","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o4lkVfwo","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 2+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oPFjVfws","title":"Software Engineer in Test - West Coast","requisitionId":"Critical Hire QAEng4","category":"Engineering","jobtype":{},"location":"San Francisco, CA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oPFjVfws","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oPFjVfws","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 2+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"o3lkVfwn","title":"Software Engineer in Test - West Coast","requisitionId":"Critical Hire QAEng3","category":"Engineering","jobtype":{},"location":"San Francisco, CA, United States","date":"8/4/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o3lkVfwn","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o3lkVfwn","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Start-Ups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br /><strong>About the Job:</strong><br />Join a team that is building software that makes a difference. You will help create and extend automated testing frameworks, and design and build automated tests that allow the whole team to move faster. You will deeply understand what is important to our business, and make good decisions about what to test, how deeply to test it, and the risks incurred by what we're not testing. A large part of our testing happens automatically after every build of the software, leaving us time to focus on the important changes that don't lend themselves to automated tests.&nbsp;<br /><br />We need first class software engineers that are interested in building software to validate and verify our products. We need someone as passionate about helping our customers as they are passionate about technology and good engineering practices. We're an agile shop, but we're not fanatics following a religion: we take the pieces that work for us and improve our processes from there. Most importantly, we're still a work in progress, so when we bring you in, you have a lot of room to influence what we do and how we do it.<br /><br /><strong>About You:<br /></strong>&bull; You have 2+ years of professional test software development experience, as well as a strong web testing background.<br />&bull; You have strong scripting skills, especially working with Ruby, Perl or the latest and greatest language of the day.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You are extremely comfortable working with SQL and databases for test set-up and trouble-shooting purposes.<br />&bull; You are comfortable enough with Linux to set-up and maintain your own QA environment.<br />&bull; You know that insuring a good customer experience trumps testing to the spec, because sometimes even the specs have bugs.<br />&bull; You love to figure out how software has been built and pride yourself on your ability to break it.<br />&bull; You enjoy debugging applications to get to the source of the potential issue.<br />&bull; You are self-managing and have the ability to adjust to competing priorities and allocate your time as necessary to get the job done.<br />&bull; You have a BS in Computer Science or another analytical field.<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"oQQlVfwG","title":"Software Engineers - East Coast","requisitionId":"Critical Hire SWEng3","category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/23/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oQQlVfwG","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oQQlVfwG","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job:</strong><br />Are you tired of large corporate or government environments? Would you like to work on the OS of your choice? To have a smart and talented team to work with and have weekly code reviews with? Do you love to build products that have significant impact on a wider scale? Would you prefer to use Open Source tools and to work in a casual environment with free lunches and monthly happy hours? If you say \"yes\" to any of these questions, then keep reading! You can at OPOWER! We are seeking smart and talented software engineers that enjoy problem-solving and building useful products that make a difference in people's lives.<br />You will work across the entire technology stack and be fully responsible for what you build -- from design to implementation to deployment to maintenance. You will write elegant, maintainable, robust, scalable code every day.<br />This is an IDEAL job for an engineer with 3 plus years of experience who wants to be part of a small team, feel total ownership over their work, and code like a ninja to make this a raging success. We are seeking a developer who is equally comfortable with front and back end development.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&bull; Design and implement features of our product suite.<br />&bull; Code in Java using open-source technologies.<br />&bull; Contribute to the improvement of our software development process.<br />&bull; Analyze requirements of projects and collaborate with other software engineers during the design phase.<br />&nbsp;<br /><strong>About You:</strong><br />&bull; You are a developer who somehow always manages to get 10 times more done than your peers.<br />&bull; The idea of owning a large portion of a codebase gives you shivers of joy.<br />&bull; You are detail-oriented, methodical, a perfectionist and work well with others.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You have 3 plus years of software development experience and you are strong in Java, HTML, CSS and SQL.<br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still.<br />&bull; Linux and shell scripts are your friends.<br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"o2lkVfwm","title":"Software Engineers - East Coast","requisitionId":"Critical Hire SWEng2","category":"Engineering","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"6/11/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o2lkVfwm","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o2lkVfwm","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job:</strong><br />Are you tired of large corporate or government environments? Would you like to work on the OS of your choice? To have a smart and talented team to work with and have weekly code reviews with? Do you love to build products that have significant impact on a wider scale? Would you prefer to use Open Source tools and to work in a casual environment with free lunches and monthly happy hours? If you say \"yes\" to any of these questions, then keep reading! You can at OPOWER! We are seeking smart and talented software engineers that enjoy problem-solving and building useful products that make a difference in people's lives.<br />You will work across the entire technology stack and be fully responsible for what you build -- from design to implementation to deployment to maintenance. You will write elegant, maintainable, robust, scalable code every day.<br />This is an IDEAL job for an engineer with 3 plus years of experience who wants to be part of a small team, feel total ownership over their work, and code like a ninja to make this a raging success. We are seeking a developer who is equally comfortable with front and back end development.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&bull; Design and implement features of our product suite.<br />&bull; Code in Java using open-source technologies.<br />&bull; Contribute to the improvement of our software development process.<br />&bull; Analyze requirements of projects and collaborate with other software engineers during the design phase.<br />&nbsp;<br /><strong>About You:</strong><br />&bull; You are a developer who somehow always manages to get 10 times more done than your peers.<br />&bull; The idea of owning a large portion of a codebase gives you shivers of joy.<br />&bull; You are detail-oriented, methodical, a perfectionist and work well with others.<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&bull; You have 3 plus years of software development experience and you are strong in Java, HTML, CSS and SQL.<br />&bull; Experience with data warehousing and mining is a big plus. Previous work with machine learning is better still.<br />&bull; Linux and shell scripts are your friends.<br />&bull; You have a technical background and a BS or MS in a computer-related or hard science field.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;","briefdescription":{}},{"id":"o9alVfwj","title":"Sr. Recruiter","requisitionId":"GA001","category":"Recruiting","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/6/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=o9alVfwj","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=o9alVfwj","description":"&nbsp;<br /> The Job:<br /> <ul> <li>Recruit for business, marketing and sales roles.&nbsp; Lead a major recruiting effort to ramp up sales by 10-15 within the next 3 months.&nbsp; This includes planning the appropriate sourcing channels, identifying passive candidates, smiling and dialing, and assessing/selling candidates.&nbsp; </li> <li>Work with a growing recruitment team; play an active role in evolving the processes and team capabilities toward those of a smooth, well-oiled hiring machine.</li> <li>Manage process through a workflow-based applicant tracking system where candidates are tracked real-time through the process.</li> </ul> The Ideal candidate:<br /> <ul> <li>Will have worked at least 3 years as a professional recruiter; in-house experienced highly referred.</li> <li>Has completed a bachelors degree or equivalent; Masters highly desirable.</li> <li>Is a team player who has: <ul> <li>A passion for providing extreme customer service to clients and candidates.</li> <li>A relentless focus on excellence.</li> <li>Strong influence and leadership skills.</li> <li>A well-honed sense of humor.</li> </ul> </li> <li>Can effectively work with hiring leaders who have a high bar and are active partners.&nbsp; Strong influence skills will be put to good use.</li> <li>Must embrace working in a \"no prima donna\" zone.&nbsp;i.e. <ul> <li>Be flexible as processes are designed.</li> <li>Dig in and help where needed.</li> <li>Treat others with dignity and respect.&nbsp; Assume good intent.</li> </ul> </li> </ul> &nbsp;<br /> &nbsp;<br /> &nbsp;<br /> &nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oUulVfwo","title":"Director, Product - East Coast","requisitionId":"Critical Hire","category":"Product Management","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/26/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oUulVfwo","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oUulVfwo","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than thirty utilities, including seven of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /> &nbsp;<br /> <strong>About the Job:</strong><br /> &nbsp;<br /> As Director of Product Management at OPOWER you will drive the development of OPOWER&rsquo;s software-as-a-service (SaaS) platform, delivering energy efficiency impact on an unprecedented scale through. You will establish and execute upon an aggressive product roadmap to extend OPOWER&rsquo;s lead in the market. You will hire and manage a world class team of product managers while rolling up the sleeves for hands-on product innovation and problem solving. This is an ideal job for a product management director who wants to be part of a rapidly growing startup, feel real ownership and accountability over their work, and achieve dramatic success in a vibrant market.<br /> &nbsp;<br /> <br /> <strong>Responsibilities:</strong><br /><br /> <ul> <li>Establish/drive the vision and roadmap for the SaaS platform, determine key initiatives to establish generalized solutions to support massive scale across the multi-channel product offering</li> <li>Build, lead, and motivate a team of senior level product managers, hire to meet capacity needs, manage team performance, and deliver consistent measurable results</li> <li>Collaborate with user experience, sales, professional services, and other product management teams to synchronize the platform product plan with other plans</li> <li>Define and measure product success, establish and aggressively manage against KPIs, benchmark against the competition</li> <li>Develop an institutional understanding of market needs and client pain points, translate them to product solutions, phase solutions to deliver incremental business value</li> <li>Proactively identify core issues and address them with little or no oversight, deliver results, eliminate excuses</li> </ul> &nbsp;<br /> <strong>Requirements:</strong><br /><br /> <ul> <li>Experience having managed a team of product managers to deliver a highly successful SaaS or other broadly adopted consumer-facing product</li> <li>Experience with Agile product management, experience working with remote teams successfully</li> <li>Phenomenal analytical skills applied to generalizing problems and technically feasible solutions, ability to solve problems quickly, ability to establish frameworks to orient decision making</li> <li>Excellent communication skills oral and written tailored for each of a wide variety of audiences, ability to be an external face of the company in critical business settings</li> <li>Minimum education: Bachelor&rsquo;s degree in a technical discipline required, MBA or advanced degree in a technical/scientific discipline from a top university strongly preferred</li> <li>Minimum experience: 8+ years experience in a software product management role, 3+ years managing teams of decision-makers</li> </ul> &nbsp;<br /> <strong>About the Company:</strong><br /> &nbsp;<br /> Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /> <br /> WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br /> <br /> NO PHONE CALLS PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.<br /> <br /> NO EXTERNAL RECRUITERS.<br /><br />&nbsp;","briefdescription":{}},{"id":"oJgiVfwW","title":"Senior Product Manager","requisitionId":{},"category":"Product Management","jobtype":{},"location":"San Francisco, CA, United States","date":"5/25/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oJgiVfwW","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oJgiVfwW","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br />&nbsp;<br /><strong>About the Job:</strong><br />If you have relevant and cutting-edge consumer website-focused product management experience, then you may be a great candidate for OPOWER's Sr. Product Manager job opening!<br />As a Product Manager at OPOWER you will drive the development of new products and features designed to motivate and educate consumers to reduce their home energy use. We have an exciting and aggressive product roadmap that will enhance the impact of our energy efficiency programs and improve the customer experience. Our product managers take the lead in driving this agenda from ideation to launch, which means we're looking to hire someone who combines passion and experience in consumer product development with a strong ability to work closely with software development teams. This is an ideal job for a software product manager with 5+ years of experience who wants to be part of a rapidly growing startup, feel total ownership over their work, and work hard at achieving a dramatic success in a vibrant market.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Own the vision and roadmap for a wide range of products, determine key initiatives to drive the product forward, identify synergies between products <br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Document requirements for new product enhancements, consult with UX design, marketing, sales, engineering, and other product managers from concept to release<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Define and measure product success, benchmark against the competition<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Understand market needs and user pain points, translate them to product solutions, phase solutions to deliver incremental business value<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Act as a mentor across the product management team, proactively identify core issues and address them with little or no oversight<br />&nbsp;<br /><strong>Requirements:</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience having delivered excellent products, ideally consumer-facing web applications<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with Agile product management a major plus<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fantastic analytical skills, ability to solve problems quickly, establish frameworks, ability to think on your feet, and generalize solutions<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Excellent communication skills oral and written tailored for each of a wide variety of audiences<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Minimum education: Bachelor&rsquo;s degree in a technical discipline required, Master&rsquo;s degree from a top university strongly preferred, MBA nice to have<br />Minimum experience: 5-8 years experience in a software product management role&nbsp;<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /><br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;<br />&nbsp;<br /><br />&nbsp;","briefdescription":{}},{"id":"oAHfVfwb","title":"Senior Product Managers","requisitionId":{},"category":"Product Management","jobtype":{},"location":"Arlington, VA, United States","date":"5/25/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oAHfVfwb","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oAHfVfwb","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br />&nbsp;<br /><strong>About the Job:</strong><br />If you have relevant and cutting-edge consumer website-focused product management experience, then you may be a great candidate for OPOWER's Sr. Product Manager job opening!<br />As a Product Manager at OPOWER you will drive the development of new products and features designed to motivate and educate consumers to reduce their home energy use. We have an exciting and aggressive product roadmap that will enhance the impact of our energy efficiency programs and improve the customer experience. Our product managers take the lead in driving this agenda from ideation to launch, which means we're looking to hire someone who combines passion and experience in consumer product development with a strong ability to work closely with software development teams. This is an ideal job for a software product manager with 5+ years of experience who wants to be part of a rapidly growing startup, feel total ownership over their work, and work hard at achieving a dramatic success in a vibrant market.<br />&nbsp;<br /><strong>Responsibilities:</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Own the vision and roadmap for a wide range of products, determine key initiatives to drive the product forward, identify synergies between products <br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Document requirements for new product enhancements, consult with UX design, marketing, sales, engineering, and other product managers from concept to release<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Define and measure product success, benchmark against the competition<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Understand market needs and user pain points, translate them to product solutions, phase solutions to deliver incremental business value<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Act as a mentor across the product management team, proactively identify core issues and address them with little or no oversight<br />&nbsp;<br /><strong>Requirements:</strong><br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience having delivered excellent products, ideally consumer-facing web applications<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with Agile product management a major plus<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fantastic analytical skills, ability to solve problems quickly, establish frameworks, ability to think on your feet, and generalize solutions<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Excellent communication skills oral and written tailored for each of a wide variety of audiences<br />&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Minimum education: Bachelor&rsquo;s degree in a technical discipline required, Master&rsquo;s degree from a top university strongly preferred, MBA nice to have<br />Minimum experience: 5-8 years experience in a software product management role&nbsp;<br /><br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br /><br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;<br />&nbsp;<br /><br />&nbsp;","briefdescription":{}},{"id":"oTvlVfwo","title":"Associate Professional Services Engineer","requisitionId":"Critical Hire","category":"Client Services & Operations","jobtype":{},"location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oTvlVfwo","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oTvlVfwo","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br />&nbsp;<br /><strong>About the Job</strong><br />&nbsp;<br />OPOWER is looking for smart and driven engineers who are technically skilled, detail oriented, and desire to work on meaningful, large-scale energy efficiency software deployments. Every energy utility company that utilizes OPOWER&rsquo;s energy efficiency software receives a configured and deployed instance of OPOWER&rsquo;s software application, and the Associate Professional Services Engineer plays a critical role in building, customizing, deploying, maintaining, and ultimately expanding this energy efficiency program for the utility.<br />&nbsp;<br />We are looking for individuals with a solid, broad base of technical fundamentals who are seeking a high-paced, dynamic environment in which to expand and hone their arsenal of technical skills.<br />&nbsp;<br />Associate Professional Services Engineers rely on a diverse technical skill-set, including, but not limited to, writing complex SQL queries, comfort on the Linux command line, shell scripting, and a high-level programming language such as Java.&nbsp; Associate Professional Services Engineers are not expected immediately to be masters of the full spectrum of technologies used, but are expected to quickly become technical gurus and masters of all skills required to launch energy efficiency programs for new utility clients.&nbsp; Setting up new efficiency programs for our utility clients is the lifeblood of OPOWER and the Associate Professional Services role is critical to OPOWER&rsquo;s success.<br />&nbsp;<br />The Associate Professional Services Engineer works closely with a team of OPOWER employees to deliver SAAS-based energy efficiency programs on behalf of utilities, including a Program Manager, a Senior Professional Services Engineer, as well as members of the software product and QA teams.<br />&nbsp;<br /><strong>Responsibilities</strong><br /> <ul> <li>Communicate with the IT resources of the utility company client to explain requirements and coordinate proper transfer of utility data</li> <li>Analyze, transform, and load utility data from the utility clients</li> <li>Integrate utility data with additional data from various 3rd party sources to generate a holistic customer profile</li> <li>Configure and customize OPOWER&rsquo;s energy efficiency software to meet the specific needs of each client</li> <li>Maintain and provide escalated support for the utility energy efficiency programs after launch for the duration of the utility contract</li> <li>Expand the energy efficiency programs from pilot phase to large scale rollout</li> </ul> <strong>About You</strong><br /> <ul> <li>You have a computer-related technical degree and one to three years of recent, hands-on technical experience</li> <li>You are a perfectionist with a knack for sniffing out issues and solving them</li> <li>You are comfortable writing SQL and have recent experience with relational databases, MySQL preferred</li> <li>You have experience in Linux and are not afraid of the command line</li> <li>You demonstrate some programming knowledge (most of our code is in Java, but Ruby, Perl, Python, even VBA have their places too)</li> <li>You are a smart, talented, diamond-in-the-rough engineer, looking for an exciting, high-paced company to expand your toolbox and master your skills.</li> <li>Strong verbal and written communication skills are a strict requirement of the Associate Professional Services Engineer</li> </ul> <strong>About the Company</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;<br />&nbsp;<br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oUvlVfwp","title":"Professional Services Engineer","requisitionId":"Critical Hire","category":"Client Services & Operations","jobtype":{},"location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oUvlVfwp","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oUvlVfwp","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br /><br />&nbsp;<br /><strong>About the Job</strong>&nbsp;:<br />We are looking for smart and driven engineers who are detailed oriented and love building lasting solutions for customers. Professional Services Engineer create customized systems for customer deployments using OPOWER's Insight Engine product. Professional Services Engineer interface closely with our utility customers' technical points of contact and work very closely with OPOWER&rsquo;s software R&amp;D team. Your insights and interaction with our customers will exert great influence on the functionality and design of the product. Development is primarily done in OPOWER&rsquo;s office, with limited travel to client sites.<br />&nbsp;<br />Professional Services Engineer utilize a diverse technical skillset. We are looking for well-rounded engineers with extensive experience with SQL and designing and using large databases. &nbsp;Professional Services Engineer must have experience with Linux and be comfortable with shell scripting. It is a plus to have experience with a high-level programming language, (Java).&nbsp;<br />&nbsp;<br /><strong>Responsibilities:</strong>&nbsp;<br />&bull; Act as a liaison between client IT teams and OPOWER&rsquo;s software development team to customize the applications for customers.&nbsp;<br />&bull; Analyze, transform, and load the data from our utility company partners to ensure the highest quality imports into the reporting system.<br />&bull; Integrate utility data with other data from various 3rd party sources like demographic data providers and parcel data.<br />&bull; Own all technical aspects necessary for successful client customization and delivery to market.&nbsp;<br />&bull; Problem solving, task management, client delivery.&nbsp;<br />&nbsp;<br /><strong>About You</strong>&nbsp;:<br />&bull; You have a technical background and are a diverse multi-purpose engineer.<br />&bull; You have minimum 2 years of related experience.&nbsp;<br />&bull; You are a master of SQL/MySQL and databases (with knowledge of ETL concepts if not working experience)&nbsp;<br />&bull; Linux and shell scripts are your friends.&nbsp;<br />&bull; You demonstrate some programming knowledge (Java is a plus).<br />&bull; You are detail-oriented, methodical, and a perfectionist.<br />&bull; You love to surf through large amounts of data to find and explain anomalies.&nbsp;<br />&bull; You function well in a fast-paced, informal environment where constant change is the norm and the bar for quality is set high.<br />&nbsp;<br /><strong>About the Company:</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a combination of home energy reports, carbon calculators, web applications, data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br />&nbsp;<br /><br />&nbsp;<br />&nbsp;<br /><br />&nbsp;<br />&nbsp;<br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oVvlVfwq","title":"Senior Professional Services Engineer","requisitionId":{},"category":"Client Services & Operations","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oVvlVfwq","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oVvlVfwq","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!&nbsp;<br />&nbsp;<br /><strong>About the Job</strong><br /><br />OPOWER is looking for smart, driven, and experienced engineers who are technically skilled, detail oriented, and desire to work on meaningful, large-scale energy efficiency software deployments .&nbsp; Every energy utility company that utilizes OPOWER&rsquo;s energy efficiency software receives a configured and deployed instance of OPOWER&rsquo;s software application, and the Senior Professional Services Engineer plays the lead role in building, customizing, deploying, maintaining, and ultimately expanding the energy efficiency program for the utility.<br />&nbsp;<br />We are looking for Senior Professional Services Engineers with significant experience and expertise across a broad base of technologies who are seeking a fast-paced, dynamic environment in which to utilize their arsenal of skills.&nbsp;&nbsp; In addition to rapidly becoming experts at customizing and launching OPOWER&rsquo;s energy efficiency software, Senior Professional Services Engineers are expected to use their skills and acquired institutional knowledge to design and build internal tools and processes with the aim of increasing the scalability, efficiency, and reliability of the customization and deployment process.&nbsp; Additionally, OPOWER is growing rapidly and Senior Professional Services Engineers are expected to train and mentor less experienced Associate Professional Services Engineers.<br />&nbsp;<br />Senior Professional Services Engineers rely on a diverse technical skillset, including, but not limited to: mastery of SQL and database management, significant experience on the Linux command line, experience with bash and/or perl scripting, and a high-level programming language such as Java.<br />&nbsp;<br />The Senior Professional Services Engineer is a critical member of the team of OPOWER employees who deliver OPOWER&rsquo;s SaaS-based energy efficiency programs on behalf of utility customers, including a Program Manager, an Associate Professional Services Engineer, as well as members of the software product and QA teams.&nbsp; Strong verbal and written communication skills are a strict requirement of the Senior Professional Services Engineer.<br />&nbsp;<br />Setting up new efficiency programs for our utility clients is the lifeblood of OPOWER and the Senior Professional Services Engineer role is critical to OPOWER&rsquo;s continued success.<br />&nbsp;<br /><strong>Responsibilities</strong><br /> <ul> <li>Own the relationship with the IT resources of the utility company client and be ultimately responsible for ensuring a high quality data stream from the utility</li> <li>Analyze, transform, and load utility data from the utility clients</li> <li>Integrate utility data with additional data from various 3rd party sources to generate a holistic customer profile</li> <li>Configure and customize OPOWER&rsquo;s energy efficiency software to meet the specific needs of each client</li> <li>Maintain and provide escalated support for the utility energy efficiency programs after launch for the duration of the utility contract</li> <li>Expand the energy efficiency programs from pilot phase to large scale rollout</li> <li>Mentor and train Associate Professional Services Engineers</li> </ul> <strong>About You</strong><br /> <ul> <li>You have a computer-related technical degree and four to seven years of recent, relevant, and deep hands-on technical experience</li> <li>You live to write programs or scripts to automate tasks and increase efficiency</li> <li>You are a perfectionist with a knack for sniffing out issues and solving them</li> <li>You are a SQL guru and have extensive experience with large, relational databases, MySQL preferred</li> <li>You have significant and recent Linux experience and prefer the command line</li> <li>You have some high-level programming experience (most of our code is in Java, but Ruby, Perl, Python, even VBA have their places too)</li> <li>You are an experienced, high bandwidth engineer, looking for an exciting, high-paced company to further hone your skills and showcase your expertise.</li> </ul> <strong>About the Company</strong><br /><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!&nbsp;<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;<br />&nbsp;","briefdescription":{}},{"id":"oovlVfwT","title":"Proposal Writer","requisitionId":{},"category":"Business Development","jobtype":"Full-Time","location":"Arlington, VA, United States","date":"7/14/2010","detail-url":"http://hire.jobvite.com/CompanyJobs/Job.aspx?c=qgY9Vfw2&j=oovlVfwT","apply-url":"http://hire.jobvite.com/CompanyJobs/Apply.aspx?c=qgY9Vfw2&j=oovlVfwT","description":"Do you want to help fight global climate change? In 2008, Business Week named OPOWER one of the \"Fifty Tech Startups You Should Know.\" Since then, OPOWER has grown into an industry-leading behavior-based energy efficiency and smart grid software company of software engineers, product specialists, behavioral scientists and efficiency advocates. OPOWER is already working with more than twenty-five utilities, including six of the ten biggest, to reduce energy consumption and help consumers save on their energy bills. OPOWER&rsquo;s success has been recognized by USA Today, the Washington Post, New York Times, CNN, Fox Business News, LA Times, Good Morning America, and even President Obama. This hot company continues to expand its team!<br /><br /><strong>About the Job</strong>:<br /> As a Proposal Writer at OPOWER, you will contribute to our company&rsquo;s participation in formal procurement processes and other business development efforts, positioning us to win new business. You will author compelling and professional proposals that reflect our market leadership position, while managing cross-functionally to ensure that our proposals exceed client expectations.&nbsp;<br /> <br />Our clients are Fortune 1000 companies with complex businesses, who partner with us because of our cutting-edge technology and world-class team. &nbsp;<br /> <br />This is an ideal job for an experienced proposal writer who wants to make an immediate impact within a rapidly growing startup, have ownership over their work, and work hard at achieving a dramatic success in the vibrant GreenTech marketplace.<br />&nbsp;<br />Responsibilities:<br /> <ul> <li>Author comprehensive, accurate, and professional proposals </li> <li>Partner with internal stakeholders (e.g., sales, marketing, product, analytics, design, implementation) to blend our product&rsquo;s features, market intelligence, and company positioning into text that conveys our value proposition </li> <li>Translate text into benefit-focused graphics, both independently and with our in-house design team</li> <li>Facilitate bid evaluation and proposal strategy </li> <li>Assist the Proposal Manager in optimizing on-time production and delivery of all RFPs/bids, from forecasting to winning </li> <li>Maintain proposal content library so that documentation and learnings are captured for future use&nbsp;</li> <li>Work with product development team to develop and hone technical documentation/user guides</li> </ul> About You:<br /> <ul> <li>You have BA/BS from a top university, with a minimum of 2 years experience in proposal writing/coordination.</li> <li>You love to write and do it well.</li> <li>You have good visual design skills, which you use to generate visually appealing and compelling graphics and documents. </li> <li>You can manage by influence, leading cross-functional teams towards a common purpose. </li> <li>You can translate technical features into customer benefits.</li> <li>You have demonstrated success in navigating through complex procurement processes.</li> <li>You are detail-oriented with superb organizational skills and strong follow-through.</li> <li>You have great ability to prioritize and manage schedules.</li> <li>You function well in a fast-paced, informal, team-focused environment where constant change is the norm and the bar for quality is set high.</li> </ul> <strong>About the Company</strong><br />Founded in June 2007, OPOWER creates innovative software products that promote energy efficiency by empowering residential consumers to make better decisions on their energy usage. Through a platform which delivers home energy reports, robust online&nbsp; tools, insights based on data analytics, and customer service tools, OPOWER is reshaping the outlook on home energy demand and&nbsp;achieving unprecedented energy savings across hundreds of thousands of households. &nbsp;The company is well funded and making big headlines as they stay on track&nbsp;to reach two million households by the end of 2010 and save enough energy to power a city of 150,000 residents!<br />&nbsp;<br />WE DO SPONSOR VISAS/TRANSFERS WHEN APPLICABLE.<br />&nbsp;<br />NO PHONE CALLS, PLEASE.&nbsp;THE FASTEST WAY TO GET A RESPONSE IS BY SENDING YOUR RESUME TO THE LINK BELOW.&nbsp; (IF YOU CALL THEN WE ARE JUST GOING TO ASK YOU TO EMAIL YOUR RESUME).<br />&nbsp;<br />NO EXTERNAL RECRUITERS.<br /><br />&nbsp;<br />&nbsp;<br />&nbsp;","briefdescription":{}}]}